#### commenting methods

In [ ]:
/* .......
 ........
    .......*/
    
#single line comment
--line of code

#### Data Selection _Simplest

In [ ]:
select column_01
from Table_01

In [ ]:
select column_01 ,column_02
from Table_01
limit 5; #limited to only 5 data from the db

#### Filter

In [ ]:
select col_01 ,col_02
from table_01
where col_01 > 10;

In [ ]:
=   equal
<>  not equal
> / < greater than /less than
>= greater than or equal to
<= less than or equal to
BETWEEN  #Inbetween two digits 
       eg :WHERE col_1 BETWEEN 15 And 25;
IS NULL   #select a null value for conditions

##### Filter with condition between columns

In [ ]:
select col_t1_1 ,col_t1_2,col_t2_1,col_t2_2
from table1 ,table2
where table1.id =table2.id

the above query will match the id between the table_1 and table_2 and return the selected columns

##### Table Alias

In [ ]:
select col_1,col_2
from table_1 as t1 ,table_2 as t2

#from table_1  t1 ,table_2  t2   --above can be written in both ways

In [ ]:
select col_1 as c1 ,col_2 as c2
from table_1 as t1

Self join cannot be used without Alias

##### IN operator

In [ ]:
this will filter wrt the input in the list (this should match with the whole content within the cell)

In [ ]:
select col_1,col_2
from table_1
where col_1 IN ('k','l','o','p');

###### OR Operator

In [ ]:
select col_1
from table_1
where col_2 = 'A'  OR 'B'
#If first condition meets then it will not go to check second and return the result

###### AND operator

In the below example without paranthesis, the and and or execute seperately and give the result meeting both the condiion

In [ ]:
select col_1
from table_1
where col_1 =10 OR col_1 =5
And col_2 < 100 ;

In case if we need to filter Or filter first and inside that resultant data need to apply and followed condition 
then include a paranthesis

In [ ]:
select col_1
from table_1
where (col_1 =10 OR col_1 =5)
And col_2 < 100 ;

#### NOT operator

In [ ]:
select col_1
from table_1
where NOT col_1= 'A' And  not col_1 ='C';

##### WILD CARDS

%wor    select all the data ends with wor
wor%    select all the data starts with wor
%wor%   select all the data before and after wor
a%P     slect all starts with a and ends with p
Wild cards will not work with null
wildcards takes longer to run compared to other operators like =,>,<, etc

In [ ]:
select col_1
from table_1
where col_1 LIKE %ent

##### SORT

In [ ]:
select col_1
from table_1
where col_1 = 15
order by col_3 ASC ; #ascending order

In [ ]:
select col_1
from table_1
where col_1 = 15
order by col_3 DESC ; #Descending order

In [ ]:
select col_1
from table_1
where col_1 = 15
order by 2,3,4 DESC ; #Descending order
#order by 2nd column then 3rd column etc

# order by Col_1,col_2,c-l_4 DESC

##### Combining columns or apply math over values

In [ ]:
select col_1 ,
       col_1 *col_2 as col_mult
from table_1 

#creating third column by applying math between columns

In [ ]:
select col_1 ,
       col_1 *2 as col_double
from table_1 

#creating third column by applying math operation with numbericals

### Grouping

below comment will group the table wrt the repetative value of col_2, similar to groupby function inpandsas

In [ ]:
select col_1,col_2
from table_1
group by col_3;

#### Applying Aggregate with groupby

In [ ]:
select col_3 ,count (col_1) as count_col_1
from table_1
group by col_3

Above code will group the table_1 wrt the col_3, and appplying count will return the number of records in each group
to get this result we can add any col excep the col used to group by ie:col_3

In [ ]:
select col_3 ,sum (col_1) as total_col_1
from table_1
group by col_3

Above code will group the table_1 wrt the col_3, and appplying sum will return the sum of records of col_1 in each group

##### HAVING function with Groupby

In [ ]:
select col_1,col_2 ,count (col_2) as col_1_count
from table_1
group by col_1
having col_1_count > 15;

#### SUB Query

### Applying Aggregate Function

###### Count

Count with null value

In [ ]:
select count(*) as total_counts
from table_1

Count without null value

In [ ]:
select count(col_1) as total_Nonnull
from table_1

##### MAX /MIn /SUM/ AVG

In [ ]:
select sum(col_1) as total_col_1
from table_1   #sum of all the values in col_1

In [ ]:
select max(col_1) as max_col_1
from table_1 #max value in col_1

In [ ]:
select min(col_1) as min_col_1
from table_1 #min val in col_1

###### Distince Function

If not mentioned mysql will return all the values , including the repetative values
if distinct mentioned it will return only the unique values

In [ ]:
select distinct col_3
from table_1

In [ ]:
select count(distinct col_3)
from table_1

### JOINs

#### Cross Joins

In [ ]:
select col_t1_1 ,col_t2_1
from table_1 CROSS JOIN table_2 ;

##### Self Joins

In [ ]:
select col_1,col_2 ..
from table_1 as t1 ,table_1 as t2
where t1.id =t2.id
      And t1.name = t2.name

#### Inner Joins

Joining the tables based on the common ids between the id from table_1 and table_2

In [ ]:
select t1. col_t1_1 , t1. col_t1_2, t2.col_t2.1
from table_1 as tl INNER JOIN table_2 as t2  
     ON t1.id =t2.id

Below is an example for nested inner join

table_1  = id ,col_t1_1 ,col_t1_2 
table_2 = id ,cid ,col_t2_1 ,col_t2_2 
table_2 = cid ,col_t3_1 ,col_t3_2

In [ ]:
select t1. col_t1_1 , t1. col_t1_2, t2.col_t2.1 ,t3.col_t3_2 
from ((table_1 as tl INNER JOIN table_2 as t2  
     ON t1.id =t2.id) 
           INNER JOIN table_3 as t3 
            ON  t3.cid=t2.cid)

#### Left Join

All the records from the left table and matching records from the second table

table_1  = id ,col_t1_1 ,col_t1_2 
table_2 = id ,cid ,col_t2_1 ,col_t2_2 
table_2 = cid ,col_t3_1 ,col_t3_2

In [ ]:
select c.customername , o.orderid

from customers c
     LEFT JOIN orders o 
      on c.customerid =o.customerid

in above example we have two tables, onw with whole customer id and details and another table with orders 
so this above query bring all the customer ids from first table and ,include the order id from second table in case any of the 
customers from table1 placd an order

#### Full Outer Join

In [ ]:
select t1.col_1 ,t2.col_1
from table_1 as t1
     FULL OUTER JOIN table_2 as t2
      ON t1. id=t2.id

In [ ]:
Select c.customername, o.orderid
from customers as c
     FULL OUTER JOIN orders as o
     ON c.customerid =o.customerid
order by c.customerid

### UNION

In [ ]:
select col
from table_1
UNION
select col
from table_2;

In [ ]:
select nname,salary 
from company1
where salary > 1000

UNION

select name,salary
from company2
where salary >1000

In union respective columns datatype in both tabls should match

#### String Concatination

In [ ]:
select col_1 ,col_2,
       col_1 || col_2
from table_1

#result will be 'col_1col_2'

In [ ]:
select col_1 ,col_2,
       col_1 || ' , '  || col_2
from table_1

result will be 'col_1 , col_2'

#### TRIM out the WHITE SPACE

In [ ]:
SELECT 
    TRIM ( '    MySQL TRIM Function   ')

In [ ]:
LTRIM  #left trim
RTRIM  #right trim

#### SUB STRINGS

In [ ]:
select col_1
       SUBSTR (col_1, 3,4)
from Table_1

In [ ]:
in above the first number represents the position counting from 1 as first position,
and second is the number of strings from that position 
for example if the string is p=Englishlanguage , SUBSTR (p, 3,4) gives output 'glis'

#### Upper and Lower Case Updation

In [ ]:
select upper (col-1)
from table_1

In [ ]:
select  lower (col-1)
from table_1

In [ ]:
select ucase (col-1)
from table_1

## DATE TIME

##### Simple Date format Column

###### Current data and Time

In [ ]:
SELECT STRFTIME('%Y %m %d', 'now' )  #to get current date

#DATE('now')

In [ ]:
SELECT STRFTIME('%H %M %S %s', 'now' )  #to get current hour min sec and millisecond

##### Simple Date format Column

In [ ]:
#f date column in the format yyy-mm-day-hh-min-sec 

select birthdate,
        STRFTIME('%Y',Birthdate) AS year,
        STRFTIME('%m',birthdate) AS Month,
        STRFTIME('%d',birthdate) AS Day
from table_1
 """
 Above code will give you three seperate columns with year month date
 """

In [ ]:
To get the age

In [ ]:
select birthdate,
        STRFTIME('%Y',Birthdate) AS year,
        STRFTIME('%m',birthdate) AS Month,
        STRFTIME('%d',birthdate) AS Day,
        DATE (('NOW') -Birthdate)) as agedata
from Table_1

#### CASE

In [ ]:
select col_1 ,col_2,
case
      WHEN (col_2 between 2 and 3) THEN 'two'
      WHEN (col_2 between 4.0 and 5.0) THEN 'four'
      else 'None'

      end as numbering
from table_1

In [ ]:
select col_1 ,col_2,
case
      WHEN (col_2 <2) THEN 'two'
      WHEN (col_2 > 4) THEN 'four'
      else 'Three'

      end as numbering
from table_1

#### Views

In [ ]:
#creating a view
CREATE VIEW View_01
AS 
SELECT Col_1,
from table_1

In [ ]:
select * 
from View_01

In [ ]:
select * 
from View_01
DROP VIEW view_01

# CLEVER CLOUD

In [28]:
#!pip3 install mysql-connector-python

In [2]:
import mysql.connector
import pandas as pd

In [3]:


connection = mysql.connector.connect(
  host="", # replace username, hostname, password and database name appropriately
  user="",
  password="",
  database=""
)

cursor1 = connection.cursor()

In [3]:
#cursor1.execute("CREATE TABLE Test_table (name VARCHAR(255), place VARCHAR(255))")

In [4]:
cursor1.execute("SHOW TABLES")

for x in cursor1:
    print(x)

('TRAIL_DA',)
('Test_table',)

In [5]:
#cursor1.execute("CREATE TABLE subject (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), teacher VARCHAR(255))")

In [6]:
#cursor1.execute("ALTER TABLE Test_table ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

In [5]:
cursor1.execute("ALTER TABLE Test_table  AUTO_INCREMENT=0")

#### INSERT TUPLES INTO THE DF

In [6]:
sql="INSERT INTO Test_table (name,place) VALUES (%s ,%s)"  #insert a single tuple
val=('Kiran','Pune')

cursor1.execute(sql,val)

In [7]:
connection.commit()
print(cursor1.rowcount,"tuple inserted")

1 tuple inserted

In [8]:
cursor1.execute()

TypeError: execute() missing 1 required positional argument: 'operation'

In [9]:
#cursor1 = connection.cursor()
sql="INSERT INTO Test_table(name,place) VALUES (%s,%s)"

val=[('christina','Cov'),
    ('Sharlene','Cov')]

cursor1.executemany(sql,val)

In [10]:
print(cursor1.rowcount,'tuple were inserted')

2 tuple were inserted

#### SELECT DATA FROM A TABLE

In [11]:
cursor1.execute("SELECT * FROM Test_table")

In [12]:
result1 =cursor1.fetchone()   #fetch the first tuple
print(result1)

('Kiran', 'Pune', 1)

In [13]:
result2=cursor1.fetchall()   #fetch all the tuple

for i in result2:
    print(i)

('christina', 'Cov', 2)
('Sharlene', 'Cov', 3)
('Kiran', 'Pune', 4)
('Kiran', 'Pune', 5)
('Kiran', 'Pune', 6)
('christina', 'Cov', 7)
('Sharlene', 'Cov', 8)
('Kiran', 'Pune', 9)
('Kiran', 'Pune', 10)
('christina', 'Cov', 11)
('Sharlene', 'Cov', 12)

In [14]:
cursor1.execute("SELECT name FROM Test_table")

myresult3 =cursor1.fetchall()

for i in myresult3:
    print(i)

('Kiran',)
('christina',)
('Sharlene',)
('Kiran',)
('Kiran',)
('Kiran',)
('christina',)
('Sharlene',)
('Kiran',)
('Kiran',)
('christina',)
('Sharlene',)

In [15]:
cursor1.execute("SELECT place,name 
                FROM Test_table")

myresult4 =cursor1.fetchall()

for i in myresult4:
    print(i)

('Pune', 'Kiran')
('Cov', 'christina')
('Cov', 'Sharlene')
('Pune', 'Kiran')
('Pune', 'Kiran')
('Pune', 'Kiran')
('Cov', 'christina')
('Cov', 'Sharlene')
('Pune', 'Kiran')
('Pune', 'Kiran')
('Cov', 'christina')
('Cov', 'Sharlene')

In [18]:
cursor1.execute("SELECT name ,place FROM Test_table")
myresult5 =cursor1.fetchall()

for i in myresult5:
    print(i)

('Kiran', 'Pune')
('christina', 'Cov')
('Sharlene', 'Cov')
('Kiran', 'Pune')
('Kiran', 'Pune')
('Kiran', 'Pune')
('christina', 'Cov')
('Sharlene', 'Cov')
('Kiran', 'Pune')
('christina', 'Cov')
('Sharlene', 'Cov')

#### Limit the Display

In [19]:
cursor1.execute( "SELECT * FROM Test_table LIMIT 2")  #show only two results

result2 =cursor1.fetchall()

for x in result2:
    print(x)

('Kiran', 'Pune', 1)
('christina', 'Cov', 2)

#### Filter Application

In [20]:
funct1="SELECT name ,place FROM Test_table WHERE name ='Kiran'"

cursor1.execute(funct1)
result_6 =cursor1.fetchall()

for i in result_6:
    print(i)

('Kiran', 'Pune')
('Kiran', 'Pune')
('Kiran', 'Pune')
('Kiran', 'Pune')
('Kiran', 'Pune')

In [21]:
print(result_6)

[('Kiran', 'Pune'), ('Kiran', 'Pune'), ('Kiran', 'Pune'), ('Kiran', 'Pune'), ('Kiran', 'Pune')]

#### Delete Tuples

In [22]:
funct2= "DELETE FROM Test_table WHERE name ='Kiran'"

cursor1.execute(funct2)

print(cursor1.rowcount, "are delected")

5 are delected

#### Fetch Data with Filter

In [23]:
funct4="SELECT count(*) FROM Test_table WHERE name ='Christina'"

cursor1.execute(funct4)

result4=cursor1.fetchall()

for i in result4:
    print(i)

(3,)

#### Table Updation

In [33]:
funct5="UPDATE Test_table SET name ='kc' WHERE name ='Kiran'"

cursor1.execute(funct5)

print(cursor1.rowcount, 'are affected')

3 are affected

In [34]:
#to check the table for changes
funt1="SELECT name ,place FROM Test_table "
cursor1.execute(funt1)
result_6 =cursor1.fetchall()

for i in result_6:
    print(i)

('kc', 'Pune')
('Christina C', 'Cov')
('Sharlene', 'Cov')
('kc', 'Pune')
('kc', 'Pune')

#### Count the data in the Table

In [17]:
filt3= "SELECT count(*) FROM Test_table"

cursor1.execute(filt3)

result3 =cursor1.fetchall()

for x in result3:
        print(x)

(2,)

#### CONVERT INTO PANDAS DF FOR ANALYSIS

In [66]:
print(result2)

[('christina', 'Cov', 2), ('Sharlene', 'Cov', 3), ('Kiran', 'Pune', 4), ('Kiran', 'Pune', 5), ('Kiran', 'Pune', 6), ('christina', 'Cov', 7), ('Sharlene', 'Cov', 8)]

In [74]:
col1=list(zip(result2))  #this is just to show the difference of list creation without the * in the command
col1

[(('christina', 'Cov', 2),),
 (('Sharlene', 'Cov', 3),),
 (('Kiran', 'Pune', 4),),
 (('Kiran', 'Pune', 5),),
 (('Kiran', 'Pune', 6),),
 (('christina', 'Cov', 7),),
 (('Sharlene', 'Cov', 8),)]

In [75]:
col2=list(zip(*result2))
col2

[('christina', 'Sharlene', 'Kiran', 'Kiran', 'Kiran', 'christina', 'Sharlene'),
 ('Cov', 'Cov', 'Pune', 'Pune', 'Pune', 'Cov', 'Cov'),
 (2, 3, 4, 5, 6, 7, 8)]

In [79]:
df=pd.DataFrame({'name':col2[0],'address':col2[1]})

In [80]:
df

        name address
0  christina     Cov
1   Sharlene     Cov
2      Kiran    Pune
3      Kiran    Pune
4      Kiran    Pune
5  christina     Cov
6   Sharlene     Cov

#### Table Delection

In [81]:
funct6= "DROP TABLE subject "
#funct6 ="DROP TABLE IF EXISTS subject"
cursor1.execute(funct6)

In [82]:
#to display the table in db
cursor1.execute("SHOW TABLES") 

for x in cursor1:
    print(x)

('Test_table',)